[{"data":1,"prerenderedAt":303},["ShallowReactive",2],{"search":3},[4,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,95,99,104,109,115,120,125,130,135,140,145,150,155,160,165,170,175,180,185,190,194,199,204,208,213,218,223,228,233,238,243,248,253,258,262,268,273,278,283,288,293,298],{"id":5,"title":6,"titles":7,"content":8,"level":9},"/blog/ansible","Tổng quan và cấu hình Ansible",[],"Hướng dẫn chi tiết về cài đặt, cấu hình SSH, inventory và sử dụng Playbook trong Ansible. Hướng dẫn chi tiết về cài đặt và triển khai Ansible Ansible là một công cụ tự động hóa mạnh mẽ, giúp quản lý cấu hình, triển khai ứng dụng và điều phối hệ thống một cách dễ dàng. Trong bài viết này, chúng ta sẽ tìm hiểu cách cài đặt, cấu hình và sử dụng Ansible thông qua các ví dụ thực tế.",1,{"id":11,"title":12,"titles":13,"content":14,"level":9},"/blog/ansible#️-cài-đặt-ansible","🛠️ Cài đặt Ansible",[],"Hướng dẫn cài đặt Ansible trên Ubuntu: Sau khi cài đặt, bạn có thể kiểm tra phiên bản Ansible:",{"id":16,"title":17,"titles":18,"content":19,"level":9},"/blog/ansible#cấu-hình-ssh","🔑 Cấu hình SSH",[],"Để Ansible có thể kết nối đến các máy chủ từ xa, bạn cần cấu hình SSH. Dưới đây là cách sao chép SSH key đến máy chủ khác: Lưu ý: Thay vinhtieng@123.3123.12 bằng tên người dùng và địa chỉ IP của máy chủ từ xa.",{"id":21,"title":22,"titles":23,"content":24,"level":9},"/blog/ansible#hosts-inventory","📋 Hosts - Inventory",[],"File inventory là nơi bạn định nghĩa danh sách các máy chủ mà Ansible sẽ quản lý. Đây là một ví dụ cơ bản:",{"id":26,"title":27,"titles":28,"content":29,"level":9},"/blog/ansible#kiểm-tra-kết-nối-ping","🏓 Kiểm tra kết nối (Ping)",[],"Bạn có thể kiểm tra kết nối đến các máy chủ bằng lệnh ping: Ping với file hosts mặc định: Ping với file inventory tùy chỉnh:",{"id":31,"title":32,"titles":33,"content":34,"level":9},"/blog/ansible#playbook-task-module","📜 Playbook - Task - Module",[],"Playbook là nơi bạn định nghĩa các tác vụ (tasks) cần thực hiện trên các máy chủ. Dưới đây là cách chạy một playbook: Ví dụ về Playbook đơn giản:",{"id":36,"title":37,"titles":38,"content":39,"level":9},"/blog/ansible#tài-liệu-tham-khảo","📚 Tài liệu tham khảo",[],"Ansible DocumentationAnsible GalaxyAnsible Playbook Guide Tóm lại: Ansible là công cụ mạnh mẽ giúp tự động hóa các tác vụ quản trị hệ thống. Việc nắm vững cách sử dụng Ansible sẽ giúp bạn tiết kiệm thời gian và giảm thiểu lỗi trong quá trình quản lý hệ thống.",{"id":41,"title":42,"titles":43,"content":44,"level":9},"/blog/basic-nginx","Tổng quan và cấu hình thông dụng Nginx",[],"Hướng dẫn chi tiết về cấu hình mặc định, PHP-FPM và thiết lập Load Balancer với Nginx. Hướng dẫn chi tiết về cấu hình và triển khai Nginx Nginx là một web server mã nguồn mở mạnh mẽ, được sử dụng phổ biến để phục vụ nội dung tĩnh, reverse proxy, cân bằng tải, bảo mật và hỗ trợ PHP thông qua FastCGI. Trong bài viết này, chúng ta sẽ đi qua các cấu hình từ cơ bản đến nâng cao, bao gồm: Cách cài đặt NginxCấu hình máy chủ mặc định (default host)Tích hợp với PHP-FPMThiết lập Load Balancer (cân bằng tải)Gzip, HTTP/2, Rate limitingRedirect, RewritesHardening & SecurityLogging nâng cao",{"id":46,"title":47,"titles":48,"content":49,"level":9},"/blog/basic-nginx#️-cài-đặt-nginx","🛠️ Cài đặt Nginx",[],"Hướng dẫn cài đặt Nginx trên Ubuntu: Sau khi cài đặt, bạn có thể kiểm tra trạng thái Nginx: Kiểm tra tường lửa: Sau khi cài đặt Nginx, bạn nên đảm bảo rằng tường lửa (firewall) cho phép lưu lượng HTTP và HTTPS để máy chủ có thể phục vụ nội dung web. Lệnh sudo ufw allow 'Nginx Full' sẽ mở cả hai cổng 80 (HTTP) và 443 (HTTPS).\nSau đó, dùng sudo ufw status để xác nhận rằng các cổng này đã được mở. Nếu bạn chưa bật ufw (Uncomplicated Firewall), bạn có thể bật bằng lệnh sudo ufw enable. Tuy nhiên, hãy đảm bảo cấu hình chính xác để không bị khóa SSH. Kiểm tra hoạt động của Nginx: Mở trình duyệt và truy cập địa chỉ:\n👉 http://\u003Cđịa_chỉ_IP_của_bạn> hoặc http://localhost nếu kiểm tra cục bộ. Bạn sẽ thấy trang mặc định “Welcome to nginx!” nếu mọi thứ hoạt động đúng cách.",{"id":51,"title":52,"titles":53,"content":54,"level":9},"/blog/basic-nginx#️-cấu-hình-default-host-trong-nginx","⚙️ Cấu hình Default Host trong Nginx",[],"Trên Ubuntu, file cấu hình của Nginx thường được lưu tại các vị trí sau: /etc/nginx/sites-available/default (Nếu sử dụng thư mục sites-available và sites-enabled)./etc/nginx/conf.d/default.conf (Thông dụng cho các cấu hình đơn giản). Mặc định, khi cài đặt Nginx, sẽ có một file cấu hình default trong thư mục /etc/nginx/sites-available/ với một số cấu hình cơ bản. Bạn có thể sửa file này để cấu hình server block cho website của mình. Cấu hình Default Host Mở file cấu hình Nginx mặc định: Mặc định, Nginx sẽ chọn block đầu tiên khi không tìm thấy server_name tương ứng. Để cấu hình rõ ràng host mặc định, bạn thêm default_server vào dòng listen: Ghi chú: listen 80 default_server;: Cấu hình Nginx lắng nghe cổng 80 (HTTP) và đánh dấu đây là default_server (server mặc định cho các yêu cầu không khớp với server block khác).root /var/www/html;: Đường dẫn tới thư mục chứa các tệp tin của website. Bạn có thể thay đổi đường dẫn này thành thư mục của website bạn muốn phục vụ.server_name _;: Chỉ thị này cho phép server chấp nhận tất cả các yêu cầu không khớp với server block khác. Nếu bạn có tên miền cụ thể, hãy thay thế dấu gạch dưới (_) bằng tên miền của bạn.location /: Đây là phần cấu hình định tuyến cho các yêu cầu đến. Cấu hình này giúp Nginx tìm kiếm các tệp tin khi người dùng truy cập vào website.try_files $uri $uri/ =404;: Nếu yêu cầu không trùng khớp với tệp tin hoặc thư mục, sẽ trả về lỗi 404. Sau khi chỉnh sửa xong, bạn cần kiểm tra xem cấu hình có chính xác không: Nếu không có lỗi nào, bạn có thể khởi động lại Nginx để áp dụng cấu hình mới: Giới thiệu về sites-available và sites-enabled Trong Nginx, thư mục sites-available và sites-enabled là một cơ chế để quản lý các website (virtual hosts) mà Nginx có thể phục vụ. Cấu trúc này giúp dễ dàng bật/tắt các website mà không cần phải xóa hoặc thay đổi cấu hình trực tiếp. sites-available: Đây là nơi bạn tạo và lưu trữ tất cả các file cấu hình của các website hoặc ứng dụng mà bạn muốn Nginx phục vụ.Mỗi file cấu hình trong sites-available đại diện cho một website hoặc ứng dụng riêng biệt.Ví dụ: /etc/nginx/sites-available/example.com là cấu hình cho website example.com. sites-enabled: Đây là nơi chứa các liên kết tượng trưng (symlink) đến các file cấu hình trong sites-available mà bạn muốn Nginx thực thi.Các liên kết này cho phép Nginx biết được website nào sẽ được kích hoạt.Bạn không nên trực tiếp chỉnh sửa các file trong sites-enabled. Thay vào đó, bạn tạo symlink từ sites-available. Cách thức hoạt động: Khi bạn tạo một file cấu hình trong sites-available, bạn có thể kích hoạt nó bằng cách tạo một symlink đến file đó trong thư mục sites-enabled.Để tạo symlink, sử dụng lệnh ln -s. Ví dụ, nếu bạn có cấu hình example.com trong sites-available, bạn có thể tạo symlink vào sites-enabled như sau:",{"id":56,"title":57,"titles":58,"content":59,"level":9},"/blog/basic-nginx#cấu-hình-nginx-với-php-fpm","🐘 Cấu hình Nginx với PHP-FPM",[],"Để xử lý các file PHP, bạn cần kết nối Nginx với PHP-FPM qua socket hoặc TCP: Lưu ý: Đường dẫn socket có thể thay đổi tùy phiên bản PHP.Nếu dùng TCP:",{"id":61,"title":62,"titles":63,"content":64,"level":9},"/blog/basic-nginx#load-balancer-trong-nginx","🌐 Load Balancer trong Nginx",[],"Nginx hỗ trợ cấu hình cân bằng tải với nhiều thuật toán lựa chọn backend: round-robin: Mặc định, phân phối đều cho các request.least_conn: Chọn server ít kết nối nhất.ip_hash: Duy trì session cho client.least_time: chọn server có thời gian phản hồi ít nhất Có thể thêm trọng số cho server bằng cách thêm số sau ip:port Ex: server 192.168.1.0:8000 weight=3; Cấu hình server block proxy đến upstream:",{"id":66,"title":67,"titles":68,"content":69,"level":9},"/blog/basic-nginx#gzip-compression","📦 Gzip Compression",[],"Bật gzip giúp tăng tốc độ tải trang bằng cách nén nội dung trả về:",{"id":71,"title":72,"titles":73,"content":74,"level":9},"/blog/basic-nginx#kích-hoạt-http2","⚡ Kích hoạt HTTP/2",[],"HTTP/2 cải thiện hiệu suất thông qua multiplexing và header compression:",{"id":76,"title":77,"titles":78,"content":79,"level":9},"/blog/basic-nginx#rate-limiting","🚦 Rate Limiting",[],"Giới hạn số lượng request để tránh DDoS và abuse:",{"id":81,"title":82,"titles":83,"content":84,"level":9},"/blog/basic-nginx#redirect-và-rewrites","🔁 Redirect và Rewrites",[],"Chuyển hướng toàn bộ traffic HTTP sang HTTPS: Viết lại URL cho SPA:",{"id":86,"title":87,"titles":88,"content":89,"level":9},"/blog/basic-nginx#hardening-security","🔐 Hardening & Security",[],"Bảo vệ server bằng cách từ chối truy cập file nhạy cảm: Ẩn thông tin server: Chống clickjacking và XSS:",{"id":91,"title":92,"titles":93,"content":94,"level":9},"/blog/basic-nginx#logging-nâng-cao","📊 Logging nâng cao",[],"Cấu hình custom log format để dễ debug:",{"id":96,"title":37,"titles":97,"content":98,"level":9},"/blog/basic-nginx#tài-liệu-tham-khảo",[],"Nginx DocumentationNginx Load Balancing GuideNginx + PHP-FPM SetupOWASP Nginx Hardening Guide Tóm lại: Nginx là công cụ cực kỳ mạnh mẽ và linh hoạt, không chỉ giới hạn ở web server mà còn là reverse proxy, caching layer, và load balancer. Việc nắm vững và khai thác tốt các tính năng sẽ giúp hệ thống của bạn hiệu suất cao, bảo mật và dễ mở rộng.",{"id":100,"title":101,"titles":102,"content":103,"level":9},"/blog/basic-redis","Cơ Bản Về Redis và Tích Hợp Với Node.js",[],"Tìm hiểu các khái niệm cơ bản về Redis bao gồm các kiểu dữ liệu và phương thức, cũng như cách tích hợp Redis vào ứng dụng Node.js để sử dụng bộ nhớ đệm và các tính năng thời gian thực. Cơ Bản Về Redis và Tích Hợp Với Node.js Redis là một kho dữ liệu key-value trong bộ nhớ, mã nguồn mở, nổi tiếng với hiệu suất và tính linh hoạt. Redis hỗ trợ nhiều kiểu dữ liệu, phù hợp cho việc sử dụng bộ nhớ đệm, ứng dụng thời gian thực, hệ thống pub/sub, và nhiều hơn nữa. Trong hướng dẫn này, chúng ta sẽ tìm hiểu: Các kiểu dữ liệu trong RedisCác lệnh phổ biến của RedisCách tích hợp Redis vào dự án Node.js",{"id":105,"title":106,"titles":107,"content":108,"level":9},"/blog/basic-redis#các-kiểu-dữ-liệu-lệnh-redis","📦 Các Kiểu Dữ Liệu & Lệnh Redis",[],"Redis hỗ trợ nhiều cấu trúc dữ liệu khác nhau:",{"id":110,"title":111,"titles":112,"content":113,"level":114},"/blog/basic-redis#_1-chuỗi-strings","1. Chuỗi (Strings)",[106],"Chuỗi là kiểu dữ liệu cơ bản nhất trong Redis. Bạn có thể lưu trữ bất kỳ giá trị nào dưới dạng chuỗi, bao gồm cả số nguyên và JSON được tuần tự hóa.",2,{"id":116,"title":117,"titles":118,"content":119,"level":114},"/blog/basic-redis#_2-danh-sách-lists","2. Danh sách (Lists)",[106],"Danh sách là các tập hợp có thứ tự của chuỗi. Bạn có thể thêm phần tử vào đầu hoặc cuối danh sách.",{"id":121,"title":122,"titles":123,"content":124,"level":114},"/blog/basic-redis#_3-tập-hợp-sets","3. Tập hợp (Sets)",[106],"Tập hợp là các tập hợp không có thứ tự của các chuỗi duy nhất. Chúng hỗ trợ các phép toán như hợp, giao, và hiệu.",{"id":126,"title":127,"titles":128,"content":129,"level":114},"/blog/basic-redis#_4-băm-hashes","4. Băm (Hashes)",[106],"Băm là các bản đồ giữa trường chuỗi và giá trị chuỗi, rất lý tưởng để biểu diễn các đối tượng.",{"id":131,"title":132,"titles":133,"content":134,"level":114},"/blog/basic-redis#_5-tập-hợp-có-thứ-tự-sorted-sets","5. Tập hợp có thứ tự (Sorted Sets)",[106],"Tập hợp có thứ tự tương tự như tập hợp nhưng có một điểm số liên kết với mỗi phần tử, cho phép truy xuất theo thứ tự.",{"id":136,"title":137,"titles":138,"content":139,"level":114},"/blog/basic-redis#_6-bitmaps-hyperloglogs-streams","6. Bitmaps, HyperLogLogs, Streams",[106],"Đây là các cấu trúc nâng cao hơn:\nBitmaps được sử dụng cho các thao tác cấp bit, cho phép bạn thao tác các bit riêng lẻ trong một chuỗi. HyperLogLogs được sử dụng để ước tính số lượng phần tử duy nhất trong một tập hợp, rất hữu ích cho các trường hợp như theo dõi số lượng khách truy cập duy nhất. Streams được thiết kế cho các đường dẫn dữ liệu thời gian thực và nguồn sự kiện, cho phép bạn thêm và truy vấn dữ liệu theo chuỗi thời gian.",{"id":141,"title":142,"titles":143,"content":144,"level":9},"/blog/basic-redis#tích-hợp-redis-với-nodejs","🔧 Tích Hợp Redis Với Node.js",[],"Bạn có thể sử dụng thư viện ioredis hoặc redis client phổ biến. Dưới đây là một ví dụ với ioredis.",{"id":146,"title":147,"titles":148,"content":149,"level":114},"/blog/basic-redis#_1-cài-đặt-redis-và-ioredis","1. Cài Đặt Redis và ioredis",[142],"Đảm bảo rằng bạn đã cài đặt và chạy Redis. Bạn có thể sử dụng Docker để chạy Redis một cách dễ dàng:",{"id":151,"title":152,"titles":153,"content":154,"level":114},"/blog/basic-redis#_2-thiết-lập-cơ-bản","2. Thiết Lập Cơ Bản",[142],"Tạo một tệp có tên redis.js và thêm đoạn mã sau:",{"id":156,"title":157,"titles":158,"content":159,"level":114},"/blog/basic-redis#_3-sử-dụng-redis-trong-ứng-dụng","3. Sử Dụng Redis Trong Ứng Dụng",[142],"Bây giờ bạn có thể sử dụng Redis trong ứng dụng của mình. Dưới đây là một ví dụ về việc thiết lập và lấy giá trị:",{"id":161,"title":162,"titles":163,"content":164,"level":114},"/blog/basic-redis#_4-ví-dụ-về-bộ-nhớ-đệm","4. Ví Dụ Về Bộ Nhớ Đệm",[142],"Bạn có thể sử dụng Redis làm bộ nhớ đệm để lưu trữ dữ liệu được truy cập thường xuyên. Dưới đây là một ví dụ về việc lưu trữ kết quả truy vấn cơ sở dữ liệu vào bộ nhớ đệm:",{"id":166,"title":167,"titles":168,"content":169,"level":114},"/blog/basic-redis#_5-kết-luận","5. Kết Luận",[142],"Redis là một công cụ mạnh mẽ cho bộ nhớ đệm và các ứng dụng thời gian thực. Bằng cách tích hợp Redis vào các dự án Node.js, bạn có thể cải thiện đáng kể hiệu suất và khả năng mở rộng. Hướng dẫn này đã bao quát các khái niệm cơ bản về kiểu dữ liệu, lệnh, và cách sử dụng Redis trong ứng dụng Node.js.\nHãy khám phá thêm các tính năng nâng cao như giao dịch, scripting Lua, và clustering khi bạn đã quen thuộc hơn với Redis.\nRedis là một công cụ đa năng có thể nâng cao đáng kể ứng dụng của bạn. Happy Coding",{"id":171,"title":172,"titles":173,"content":174,"level":114},"/blog/basic-redis#_6-tài-nguyên-tham-khảo","6. Tài Nguyên Tham Khảo",[142],"Tài liệu RedisTài liệu ioredis",{"id":176,"title":177,"titles":178,"content":179,"level":9},"/blog/common-docker-file","Các Dockerfile Phổ Biến Cho Nhiều Dự Án Khác Nhau",[],"Tìm hiểu về Docker và khám phá các Dockerfile phổ biến cho nhiều dự án như Node.js, PHP với Laravel, React, Vue, Nuxt và Next.js. Khám phá các kỹ thuật tối ưu và thực hành tốt nhất. Các Dockerfile Phổ Biến Cho Nhiều Dự Án Khác Nhau Docker là một công cụ ảo hóa nhẹ giúp phát triển, triển khai và chạy ứng dụng trong các container. Nó cho phép bạn đóng gói ứng dụng và tất cả các phụ thuộc của nó vào một container duy nhất, giúp dễ dàng triển khai trên bất kỳ môi trường nào mà không cần lo lắng về sự khác biệt giữa các môi trường. Đây là một số Dockerfile cho các dự án thường gặp, bạn có thể tham khảo và điều chỉnh theo nhu cầu của mình. Nội dung bài viết được tổng hợp và tích góp từ nhiều nguồn khác nhau, bao gồm cả các dự án thực tế mà mình đã làm.",{"id":181,"title":182,"titles":183,"content":184,"level":114},"/blog/common-docker-file#dockerfile-cho-nodejs","Dockerfile cho Node.js",[177],"Dockerfile cho Node.js rất quan trọng khi triển khai ứng dụng JavaScript phía server. Đây là một Dockerfile đã được tối ưu cho một dự án Node.js điển hình: Cách 2, sử dụng pm2. Về cơ bản thì cách này nhẹ hơn kha khá so với npm",{"id":186,"title":187,"titles":188,"content":189,"level":114},"/blog/common-docker-file#dockerfile-nodejs-nestjs","Dockerfile NodeJS (NestJS)",[177],"",{"id":191,"title":192,"titles":193,"content":189,"level":114},"/blog/common-docker-file#dockerfile-nodejs-expressjs","Dockerfile NodeJS (Express.js)",[177],{"id":195,"title":196,"titles":197,"content":198,"level":114},"/blog/common-docker-file#dockerfile-reactjs","Dockerfile ReactJs",[177],"Có thể sử dụng Dockerfile này cho các dự án như Vue, Angular,... Lưu ý: ở đây thư mục chứa nginx/nginx.conf đặt cùng cấp với Dockerfile",{"id":200,"title":201,"titles":202,"content":203,"level":114},"/blog/common-docker-file#dockerfile-cho-php-với-laravel","Dockerfile cho PHP với Laravel",[177],"Lưu ý: thư mục conf/nginx.conf và conf/supervisord.conf cùng cấp với Dockerfile",{"id":205,"title":206,"titles":207,"content":189,"level":114},"/blog/common-docker-file#dockerfile-cho-nextjs","Dockerfile cho NextJs",[177],{"id":209,"title":210,"titles":211,"content":212,"level":114},"/blog/common-docker-file#đang-cập-nhật","Đang cập nhật...",[177],"Nếu bạn có các cấu hình hoặc Dockerfile khác muốn chia sẻ, vui lòng gửi email về vinhtieng123@gmail.com. Mình rất trân trọng điều đó.",{"id":214,"title":215,"titles":216,"content":217,"level":9},"/blog/jwt","JWT là gì? Cách hoạt động và ứng dụng thực tế",[],"JWT (JSON Web Token) là gì? Cách JWT hoạt động, cấu trúc gồm Header, Payload, Signature và cách ứng dụng trong xác thực bảo mật.",{"id":219,"title":220,"titles":221,"content":222,"level":9},"/blog/jwt#_1-giới-thiệu-về-jwt","1. Giới thiệu về JWT",[],"JSON Web Token (JWT) là một tiêu chuẩn mở ( RFC 7519 ) định nghĩa một cách thức nhỏ gọn và độc lập để truyền thông tin an toàn giữa các bên dưới dạng đối tượng JSON. Thông tin này có thể được xác minh và tin cậy vì nó được ký kỹ thuật số. JWT có thể được ký bằng một bí mật (với thuật toán HMAC ) hoặc một cặp khóa công khai/riêng tư bằng RSA hoặc ECDSA . Trích từ: https://jwt.io/introduction",{"id":224,"title":225,"titles":226,"content":227,"level":9},"/blog/jwt#_2-các-thành-phần-của-jwt","2. Các thành phần của JWT",[],"JWT bao gồm ba thành phần chính: Header, Payload và Signature. Mỗi phần đều được mã hóa bằng Base64Url và được phân tách bằng dấu chấm (.).\nMột JWT token thường sẽ trông như sau: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ.SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c như vậy với JWT token ở trên thì các thành phần sau khi được mã hóa sẽ là: Header: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9Payload: eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQSignature: SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c Chi tiết về các thành phần Header: Thường sẽ chứa thông tin về thuật toán mã hóa và loại token. Ví dụ: Payload: Đây là phần sẽ chứa các thông tin mà chúng ta muốn mã hóa và truyền tải. Thường thì chúng ta sẽ lưu thông tin người dùng, user_id,... Lưu ý rằng JWT token không có hết hạn, tuy nhiên chúng ta có thể giới hạn thời gian sống của token bằng cách thêm các trường như exp, nbf, iat vào payload. Và khi chúng ta xác thực token chúng ta sẽ cần thêm một bước kiểm tra thời gian sống của token. Như vậy chúng ta có thể sử dụng JWT token như một session token. Ví dụ về payload: Signature: Được tạo bằng cách mã hóa Header và Payload với một khóa bí mật và thuật toán đã chỉ định trong Header. Điều này giúp đảm bảo rằng token không bị thay đổi trong quá trình truyền tải. Ví dụ:",{"id":229,"title":230,"titles":231,"content":232,"level":9},"/blog/jwt#_3-viết-lại-hàm-để-generate-jwt-token-và-verify-jwt-token-trong-nodejs","3. Viết lại hàm để generate JWT token và verify JWT token trong NodeJs",[],"Khi làm việc với jwt và nodeJs, hầu hết mọi người sẽ sử dụng thư viện jsonwebtoken để tạo và xác thực JWT token. Tuy nhiên, để hiểu rõ hơn về cách hoạt động của JWT, chúng ta có thể tự viết hàm để tạo và xác thực JWT token. Giả sử chúng ta muốn tạo JWT token từ thông tin user_id=123, khi đó phần payload sẽ là: Ở phần header, chúng ta sẽ sử dụng thuật toán HS256 để mã hóa JWT token. Nên payload sẽ có dạng như sau: Để tạo JWT token, chúng ta cần mã hóa Header và Payload bằng Base64Url. Sau đó, chúng ta sẽ tạo chữ ký bằng cách sử dụng thuật toán HMACSHA256 với khóa bí mật (secret key) và kết hợp Header và Payload. Đầu tiên chúng ta cần viết 1 hàm để mã hóa Base64Url: Ở đây, vì chúng ta sử dụng NodeJs nên có thể sử dụng Buffer để mã hóa Base64Url. Nếu bạn đang làm việc với JavaScript trên trình duyệt, bạn có thể sử dụng btoa() để mã hóa Base64Url. Khi muốn giải mã, bạn có thể sử dụng atob(). Hàm này là hàm có sẵn trong trình duyệt. Tiếp theo, chúng ta sẽ triển khai hàm tạo JWT token. Trong Node.js, chúng ta có thể dễ dàng thực hiện điều này bằng cách dùng thư viện tích hợp sẵn là crypto, cụ thể là hàm createHmac. Hàm này sẽ giúp chúng ta tạo ra chữ ký (signature) từ chuỗi đã mã hóa gồm Header và Payload, kết hợp với secret key để đảm bảo tính toàn vẹn và xác thực của token. Full code mã hóa JWT token sẽ như sau: Như vậy chúng ta đã có hàm createJWT để tạo JWT token. Hàm này sẽ nhận vào 2 tham số là payload và secret. payload là thông tin mà chúng ta muốn mã hóa và truyền tải, còn secret là khóa bí mật mà chúng ta sẽ sử dụng để tạo chữ ký cho token. Đối với JWT token, chúng ta có thể sử dụng bất kỳ chuỗi nào làm khóa bí mật. Tuy nhiên, để đảm bảo tính bảo mật, chúng ta nên sử dụng một chuỗi ngẫu nhiên và đủ dài. Vì khi sử dụng thuật toán HMACSHA256, nếu kẻ tấn công biết được khóa bí mật, họ có thể tạo ra token giả mạo và truy cập vào hệ thống của bạn. Có thể sử dụng trang web randomkeygen.com để tạo ra một chuỗi ngẫu nhiên và đủ dài làm khóa bí mật.",{"id":234,"title":235,"titles":236,"content":237,"level":9},"/blog/jwt#_4-xác-thực-jwt-token","4. Xác thực JWT token",[],"Token JWT gồm ba phần: Header, Payload và Signature, được nối với nhau bằng dấu chấm (.). Quá trình xác thực diễn ra như sau: Tách token thành ba phần: Header, Payload và Signature.Tạo lại chữ ký bằng cách kết hợp Header và Payload đã mã hóa bằng Base64Url, sau đó sử dụng cùng thuật toán và khóa bí mật (secret key) đã được dùng khi tạo token ban đầu.So sánh chữ ký mới tạo với chữ ký ban đầu trong token:\nNếu hai chữ ký giống nhau, token được xác nhận là hợp lệ (không bị chỉnh sửa).Nếu khác nhau, token đã bị thay đổi hoặc không hợp lệ. Ngoài ra, để kiểm tra xem token có hết hạn hay chưa, bạn có thể thêm trường exp (expiration) vào Payload. Trường này lưu thời gian hết hạn dưới dạng timestamp (số giây kể từ ngày 1/1/1970). Khi xác thực, chỉ cần so sánh giá trị exp với thời gian hiện tại để biết token còn hiệu lực hay không.",{"id":239,"title":240,"titles":241,"content":242,"level":9},"/blog/jwt#_5-kết-luận","5. Kết luận",[],"JWT là một công cụ mạnh mẽ để xác thực và phân quyền trong các ứng dụng web. Bằng cách hiểu rõ cách hoạt động của JWT, bạn có thể tự tạo và xác thực JWT token mà không cần phụ thuộc vào thư viện bên ngoài. Tuy nhiên, trong thực tế, bạn nên sử dụng thư viện jsonwebtoken để tiết kiệm thời gian và công sức. Hy vọng bài viết này đã giúp bạn hiểu rõ hơn về JWT và cách sử dụng nó trong ứng dụng của mình. Nếu bạn có bất kỳ câu hỏi nào, hãy liên hệ với mình qua các kênh liên lạc như email, facebook, zalo hoặc telegram nhé!",{"id":244,"title":245,"titles":246,"content":247,"level":9},"/blog/jwt#_6-tài-liệu-tham-khảo","6. Tài liệu tham khảo",[],"jwt.ioRFC 7519 - JSON Web Token (JWT)jsonwebtoken",{"id":249,"title":250,"titles":251,"content":252,"level":9},"/blog/use-effect-and-use-layout-effect","Phân biệt useEffect và useLayoutEffect trong React",[],"Tìm hiểu điểm khác nhau giữa useEffect và useLayoutEffect trong React, giúp bạn sử dụng đúng hook trong từng tình huống cụ thể để tối ưu hiệu năng và trải nghiệm người dùng.",{"id":254,"title":255,"titles":256,"content":257,"level":9},"/blog/use-effect-and-use-layout-effect#useeffect-và-uselayouteffect-trong-react","useEffect và useLayoutEffect trong React",[],"React cung cấp hai hook mạnh mẽ để xử lý hiệu ứng phụ: useEffect và useLayoutEffect. Tuy chúng có cú pháp giống nhau, nhưng cách chúng hoạt động khác biệt và ảnh hưởng trực tiếp đến trải nghiệm người dùng cũng như hiệu suất của ứng dụng.",{"id":259,"title":260,"titles":261,"content":189,"level":114},"/blog/use-effect-and-use-layout-effect#tóm-tắt-quy-trình-thực-thi","Tóm tắt quy trình thực thi",[255],{"id":263,"title":264,"titles":265,"content":266,"level":267},"/blog/use-effect-and-use-layout-effect#useeffect","useEffect",[255,260],"Chạy sau khi React cập nhật DOM xong và render UI xong.Thích hợp cho các tác vụ không ảnh hưởng trực tiếp đến layout, như gọi API, đăng ký sự kiện, log, animation nhẹ… Quy trình: Cập nhật lại stateCập nhật DOM (mutated)React render lại UIClean up nếu cóGọi useEffect callback",3,{"id":269,"title":270,"titles":271,"content":272,"level":267},"/blog/use-effect-and-use-layout-effect#uselayouteffect","useLayoutEffect",[255,260],"Chạy ngay sau khi DOM được cập nhật, nhưng trước khi browser vẽ lại giao diện (paint).Dùng khi bạn cần đo lường DOM, thay đổi layout hoặc ngăn nhấp nháy giao diện. Quy trình: Cập nhật lại stateCập nhật DOM (mutated)Clean up nếu dependencies thay đổiGọi useLayoutEffect callbackReact render lại UI Khi nào dùng cái nào? Tình huốngNên dùngGọi API, thao tác không ảnh hưởng layoutuseEffectĐo kích thước DOM, scroll, positionuseLayoutEffectCập nhật class, focus vào inputuseLayoutEffectHiệu ứng animation nhẹ sau renderuseEffectNgăn nháy layout (flicker) khi hiển thị componentsuseLayoutEffectCập nhật DOM trước khi browser vẽ lạiuseLayoutEffect",{"id":274,"title":275,"titles":276,"content":277,"level":9},"/blog/useful-npm-package","Tổng hợp các npm package hữu ích cho Frontend và Backend",[],"Danh sách các npm package hữu ích cho lập trình Frontend và Backend, được tổng hợp từ kinh nghiệm thực tế và các chia sẻ trong cộng đồng.",{"id":279,"title":280,"titles":281,"content":282,"level":9},"/blog/useful-npm-package#frontend","Frontend",[],"react-query - React Query Thư viện quản lý trạng thái cho React, giúp xử lý các yêu cầu API và cache dữ liệu một cách dễ dàng.@progress/kendo-react-pdf - Thư viện tạo PDF cho React, hay hơn các thư viện khác ở chỗ hình ảnh sẽ được xuất ra dưới định dạng SVG, giúp cho việc xuất ảnh chất lượng cao và nét hơn, không bị vỡ ảnh khi zoom in.react-split-pane - Thư viện tạo giao diện chia tách (split view) cho React, giúp dễ dàng tạo các layout với các phần tử có thể kéo và thả.react-window - Thư viện giúp tối ưu hóa hiệu suất cho bảng và danh sách lớn trong React bằng cách chỉ render các phần tử đang hiển thị trên UI nhẹ và dễ sử dụng.",{"id":284,"title":285,"titles":286,"content":287,"level":9},"/blog/useful-npm-package#backend","Backend",[],"Updating...",{"id":289,"title":290,"titles":291,"content":292,"level":9},"/blog/useful-npm-package#các-đoạn-code-mẫu-hữu-dụng","Các đoạn code mẫu hữu dụng",[],"Code template cho custom send and listen event document",{"id":294,"title":295,"titles":296,"content":297,"level":9},"/blog/useful-script","Tổng hợp các scripts hữu ích",[],"Danh sách các scripts hữu ích cho lập trình viên, giúp tiết kiệm thời gian và công sức trong quá trình phát triển phần mềm.",{"id":299,"title":300,"titles":301,"content":302,"level":9},"/blog/useful-script#nén-ảnh-và-convert-ảnh-sang-định-dạng-webp","Nén ảnh và convert ảnh sang định dạng webp",[],"Cài đặt cwebp Đối với window thì có thể xem hướng dẫn tại: https://developers.google.com/speed/webp/download?hl=vi Script nén ảnh Sau khi tạo xong file, cần phải gán quyền thực thi cho file script bằng lệnh sau: Sau đó có thể chạy script để có thể thực hiện nén ảnh và chuyển đổi sang định dạng webp.",1761230961299]